app/controllers/omniauths_controller.rb

SELECT  `stores`.* FROM `stores` WHERE `stores`.`store_hash` = 'oj758jizss' LIMIT 1
---
  def load
    payload = parse_signed_payload
    @payload = payload
    return render_error('[load] Invalid payload signature!') unless payload
    email = payload['user']['email']
    @email = email
    store_hash = payload['store_hash']
    # Lookup store
    @store = Store.find_by(store_hash: store_hash)